app/controllers/sms_controller.rb

SELECT * FROM `commodities` WHERE (`commodities`.`code` = ' ') LIMIT 1
SELECT * FROM `markets` WHERE (`markets`.`code` = ' ') LIMIT 1
SELECT * FROM `prices` WHERE (`prices`.`market_id` = 4 AND `prices`.`commodity_id` = 1) LIMIT 1
---
  def price
    queryparms = params[:body].scan(/\w+/)

    if(queryparms.length > 3)
      #TODO: error, there should only be three parameters
    end

    commodity = Commodity.find(:first, :conditions => {:code => queryparms[1]})
    mark = Market.find(:first, :conditions => {:code => queryparms[2]})

    if(commodity.nil?)
      #TODO error
    end
    if(mark.nil?)
      #TODO error
    end

    price = Price.find(:first, :conditions => {:commodity_id => commodity.id, :market_id => mark.id})

SELECT * FROM `commodities` WHERE (`commodities`.`code` = 'M') LIMIT 1
SELECT * FROM `markets` WHERE (`markets`.`code` = 'BB1') LIMIT 1
INSERT INTO `prices` (`updated_at`, `commodity_id`, `amount`, `market_id`, `created_at`) VALUES('2010-01-31 14:56:30', 1, 600.0, 1, '2010-01-31 14:56:30')
---
  def input
    queryparms = params[:body].scan(/\w+/)

    if(queryparms.length < 4)
      #TODO: error, there should only be three parameters
    end

    commodity = Commodity.find(:first, :conditions => {:code => queryparms[1]})
    mark = Market.find(:first, :conditions => {:code => queryparms[2]})

    if(commodity.nil?)
      #TODO error
    end
    if(mark.nil?)
      #TODO error
    end

    price = Price.new
    price.commodity_id = commodity.id
    price.market_id = mark.id
    price.amount = queryparms[3].to_f
    price.save

SELECT * FROM `commodities` WHERE (`commodities`.`code` = 'M') LIMIT 1
SELECT * FROM `markets` WHERE (`markets`.`code` = 'BB') LIMIT 1
SELECT * FROM `agents` WHERE (`agents`.`commodity_id` = 1 AND `agents`.`market_id` = 2) LIMIT 1
---
  def trader
    queryparms = params[:body].scan(/\w+/)

    if(queryparms.length > 3)
      #TODO: error, there should only be three parameters
    end

    commodity = Commodity.find(:first, :conditions => {:code => queryparms[1]})
    mark = Market.find(:first, :conditions => {:code => queryparms[2]})

    if(commodity.nil?)
      #TODO error
    end
    if(mark.nil?)
      #TODO error
    end

    agents = Agent.find(:all, :conditions => {:commodity_id => commodity.id, :market_id => mark.id})